; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	spectrograph1 - mode
	image2 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star2 - direction
	GroundStation4 - direction
	Star0 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star7)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Star8 image2)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Planet11 image2)
	(have_image Star12 image2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 spectrograph1)
	(have_image Star15 image2)
	(have_image Planet16 infrared0)
	(have_image Star17 spectrograph1)
	(have_image Planet18 infrared0)
))

)

; plan
1. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 1 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 12
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 12
4. (turn_to satellite0 planet16 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet16)
   goals met: 0 of 12
5. (take_image satellite0 planet16 instrument1 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 1 of 12
6. (turn_to satellite0 planet14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet14)
   goals met: 1 of 12
7. (take_image satellite0 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 2 of 12
8. (turn_to satellite0 planet11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet11)
   goals met: 2 of 12
9. (take_image satellite0 planet11 instrument1 image2)
   added: (have_image planet11 image2)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 12
12. (turn_to satellite0 planet18 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet18)
   goals met: 4 of 12
13. (take_image satellite0 planet18 instrument1 infrared0)
   added: (have_image planet18 infrared0)
   goals met: 5 of 12
14. (turn_to satellite0 planet9 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet9)
   goals met: 5 of 12
15. (take_image satellite0 planet9 instrument1 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 6 of 12
16. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 12
17. (take_image satellite0 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 12
18. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 7 of 12
19. (take_image satellite0 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 8 of 12
20. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 8 of 12
21. (take_image satellite0 star15 instrument1 image2)
   added: (have_image star15 image2)
   goals met: 9 of 12
22. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 9 of 12
23. (take_image satellite0 star17 instrument1 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 10 of 12
24. (turn_to satellite0 star8 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star8)
   goals met: 10 of 12
25. (take_image satellite0 star8 instrument1 image2)
   added: (have_image star8 image2)
   goals met: 11 of 12
26. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 12 of 12
